# Pandas üêº

In [1]:
import pandas as pd
import numpy as np

## 1. Introdu√ß√£o

1. Series: um nome diferente para coluna, √© um array que armazena todos os valores de uma coluna em uma tabela.
2. Dataframe: uma estrutura de dados que armazena dados em colunas(series) e linhas.

## 2. Series

### 1. Criando diferentes estruturas de dados

In [2]:
minha_lista_string = ['a', 'b', 'c']
minha_lista_number = [10, 20, 30]
meu_array = np.array([10, 20, 30])
meu_dicionario = {'a':10, 'b': 20, 'c':30}

### 2. Criando uma serie pura

In [3]:
serie = pd.Series([1, 2, 3, 4, 5])

In [4]:
serie

0    1
1    2
2    3
3    4
4    5
dtype: int64

### 3. Criando uma serie com uma lista

In [5]:
pd.Series(minha_lista_string)

0    a
1    b
2    c
dtype: str

### 4. Criando uma serie definindo argumentos¬∂

In [6]:
pd.Series(data=minha_lista_string, index=minha_lista_number)

10    a
20    b
30    c
dtype: str

In [7]:
pd.Series(minha_lista_string, minha_lista_number)

10    a
20    b
30    c
dtype: str

### 5. Criando uma serie com um dicion√°rio¬∂

In [9]:
pd.Series(meu_dicionario)

a    10
b    20
c    30
dtype: int64

### 6. Criando series e somando

In [10]:
serie1 = pd.Series([1, 2, 3, 4], index=["Brasil", "Tail√¢ndia", "Isl√¢ndia", "Nepal"])

In [11]:
serie2 = pd.Series([1, 2, 3, 4], index=["Brasil", "Tail√¢ndia", "Isl√¢ndia", "Groenl√¢ndia"])

In [12]:
serie1

Brasil       1
Tail√¢ndia    2
Isl√¢ndia     3
Nepal        4
dtype: int64

In [13]:
serie1 + serie2

Brasil         2.0
Groenl√¢ndia    NaN
Isl√¢ndia       6.0
Nepal          NaN
Tail√¢ndia      4.0
dtype: float64

### 7. Acessando uma celula de serie pelo index¬∂

In [14]:
serie1[["Brasil"]]

Brasil    1
dtype: int64

In [15]:
serie1[["Brasil", "Isl√¢ndia"]]

Brasil      1
Isl√¢ndia    3
dtype: int64

## 3. dataframe

### 1. Cria√ß√£o de um dataframe

In [18]:
dataframe = pd.DataFrame(np.random.randn(5, 4), index=["A", "B", "C", "D", "E"], columns="W X Y Z".split())

In [19]:
type(dataframe)

pandas.DataFrame

### 2. Sele√ß√£o de uma serie no dataframe

In [20]:
dataframe["W"]

A    0.522926
B    0.077859
C   -0.348287
D   -0.225386
E    1.278020
Name: W, dtype: float64

In [21]:
type(dataframe["W"])

pandas.Series

### 3. Sele√ß√£o de uma serie no formato dataframe

In [22]:
dataframe[["W"]]

          W
A  0.522926
B  0.077859
C -0.348287
D -0.225386
E  1.278020

In [23]:
type(dataframe[["W"]])

pandas.DataFrame

### 4. Sele√ß√£o de m√∫ltiplas series

In [24]:
dataframe[["W", "X"]]

          W         X
A  0.522926 -1.176709
B  0.077859 -0.239699
C -0.348287 -0.490559
D -0.225386 -0.847533
E  1.278020  1.744165

In [25]:
type(dataframe[["W", "X"]])

pandas.DataFrame

### 5. Cria√ß√£o de uma coluna que √© a c√≥pia de uma coluna j√° existente

In [26]:
dataframe["new"] = dataframe["W"]

### 6. Cria√ß√£o de uma coluna que √© a soma de outras duas

In [27]:
dataframe["sum"] = dataframe["W"] + dataframe["X"]

### 7. Remo√ß√£o de uma coluna

In [29]:
dataframe.head(1)

          W         X         Y         Z       new       sum
A  0.522926 -1.176709  1.657925 -1.235896  0.522926 -0.653783

In [31]:
dataframe.drop("new", axis=1)

          W         X         Y         Z       sum
A  0.522926 -1.176709  1.657925 -1.235896 -0.653783
B  0.077859 -0.239699  0.997769  0.405365 -0.161840
C -0.348287 -0.490559  0.245674  0.107159 -0.838847
D -0.225386 -0.847533  0.260215  1.216587 -1.072919
E  1.278020  1.744165 -2.279521  1.049704  3.022185

### 8. Remo√ß√£o de uma coluna no dataframe definitivamente

In [32]:
dataframe.drop("sum", axis=1, inplace=True)

In [33]:
dataframe.head(1)

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926

### 9. Loc

In [34]:
dataframe

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926
B  0.077859 -0.239699  0.997769  0.405365  0.077859
C -0.348287 -0.490559  0.245674  0.107159 -0.348287
D -0.225386 -0.847533  0.260215  1.216587 -0.225386
E  1.278020  1.744165 -2.279521  1.049704  1.278020

In [38]:
dataframe.loc["A"]

W      0.522926
X     -1.176709
Y      1.657925
Z     -1.235896
new    0.522926
Name: A, dtype: float64

In [39]:
dataframe.loc[["A"]]

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926

In [40]:
dataframe.loc[["A", "B"]]

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926
B  0.077859 -0.239699  0.997769  0.405365  0.077859

In [42]:
dataframe.loc[["A", "B"], ["Z", "new"]]

          Z       new
A -1.235896  0.522926
B  0.405365  0.077859

### 10. Iloc

In [43]:
dataframe

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926
B  0.077859 -0.239699  0.997769  0.405365  0.077859
C -0.348287 -0.490559  0.245674  0.107159 -0.348287
D -0.225386 -0.847533  0.260215  1.216587 -0.225386
E  1.278020  1.744165 -2.279521  1.049704  1.278020

In [44]:
dataframe.iloc[3, 2]

np.float64(0.26021522464084446)

In [45]:
dataframe.iloc[0, 0]

np.float64(0.5229262199907984)

In [46]:
dataframe.iloc[:-1, :]

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926
B  0.077859 -0.239699  0.997769  0.405365  0.077859
C -0.348287 -0.490559  0.245674  0.107159 -0.348287
D -0.225386 -0.847533  0.260215  1.216587 -0.225386

In [47]:
dataframe.iloc[:-2, 1:]

          X         Y         Z       new
A -1.176709  1.657925 -1.235896  0.522926
B -0.239699  0.997769  0.405365  0.077859
C -0.490559  0.245674  0.107159 -0.348287

### 11. Filtros

In [48]:
dataframe

          W         X         Y         Z       new
A  0.522926 -1.176709  1.657925 -1.235896  0.522926
B  0.077859 -0.239699  0.997769  0.405365  0.077859
C -0.348287 -0.490559  0.245674  0.107159 -0.348287
D -0.225386 -0.847533  0.260215  1.216587 -0.225386
E  1.278020  1.744165 -2.279521  1.049704  1.278020

In [49]:
dataframe > 0

       W      X      Y      Z    new
A   True  False   True  False   True
B   True  False   True   True   True
C  False  False   True   True  False
D  False  False   True   True  False
E   True   True  False   True   True

In [50]:
dataframe[dataframe > 0]

          W         X         Y         Z       new
A  0.522926       NaN  1.657925       NaN  0.522926
B  0.077859       NaN  0.997769  0.405365  0.077859
C       NaN       NaN  0.245674  0.107159       NaN
D       NaN       NaN  0.260215  1.216587       NaN
E  1.278020  1.744165       NaN  1.049704  1.278020

In [51]:
dataframe[(dataframe["W"] > 0) & (dataframe["X"] > 0)]

         W         X         Y         Z      new
E  1.27802  1.744165 -2.279521  1.049704  1.27802

## 4. √çndices

### 1. Cria√ß√£o de um dataframe

In [54]:
dataframe = pd.DataFrame(np.random.randn(5, 4), index=["A", "B", "C", "D", "E"], columns="W X Y Z".split())

### 2. Opera√ß√µes com √≠ndices

In [55]:
dataframe

          W         X         Y         Z
A  1.021567  0.014561  0.217504 -0.578186
B  0.498543 -0.530412 -1.692473  0.866745
C  1.153215 -0.410350  1.406356 -0.914454
D  2.249367 -0.550883 -1.649351 -0.503446
E  0.155313  0.221904  1.101980  0.182031

In [56]:
dataframe.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='str')

In [57]:
dataframe.columns

Index(['W', 'X', 'Y', 'Z'], dtype='str')

In [58]:
dataframe.reset_index()

  index         W         X         Y         Z
0     A  1.021567  0.014561  0.217504 -0.578186
1     B  0.498543 -0.530412 -1.692473  0.866745
2     C  1.153215 -0.410350  1.406356 -0.914454
3     D  2.249367 -0.550883 -1.649351 -0.503446
4     E  0.155313  0.221904  1.101980  0.182031

In [60]:
novo_index = "MA PI BA RO RN".split()

In [61]:
dataframe["index"] = novo_index

In [62]:
dataframe

          W         X         Y         Z index
A  1.021567  0.014561  0.217504 -0.578186    MA
B  0.498543 -0.530412 -1.692473  0.866745    PI
C  1.153215 -0.410350  1.406356 -0.914454    BA
D  2.249367 -0.550883 -1.649351 -0.503446    RO
E  0.155313  0.221904  1.101980  0.182031    RN

In [63]:
dataframe.set_index("index")

              W         X         Y         Z
index
MA     1.021567  0.014561  0.217504 -0.578186
PI     0.498543 -0.530412 -1.692473  0.866745
BA     1.153215 -0.410350  1.406356 -0.914454
RO     2.249367 -0.550883 -1.649351 -0.503446
RN     0.155313  0.221904  1.101980  0.182031

In [64]:
dataframe.reset_index()

  level_0         W         X         Y         Z index
0       A  1.021567  0.014561  0.217504 -0.578186    MA
1       B  0.498543 -0.530412 -1.692473  0.866745    PI
2       C  1.153215 -0.410350  1.406356 -0.914454    BA
3       D  2.249367 -0.550883 -1.649351 -0.503446    RO
4       E  0.155313  0.221904  1.101980  0.182031    RN

In [65]:
dataframe.reset_index().set_index("index")

      level_0         W         X         Y         Z
index
MA          A  1.021567  0.014561  0.217504 -0.578186
PI          B  0.498543 -0.530412 -1.692473  0.866745
BA          C  1.153215 -0.410350  1.406356 -0.914454
RO          D  2.249367 -0.550883 -1.649351 -0.503446
RN          E  0.155313  0.221904  1.101980  0.182031

### 3. √çndices multin√≠veis

In [66]:
outside = ["Mulheres", "Mulheres", "Mulheres", "Homens", "Homens", "Homens"]
inside = ["Filial1", "Filial2", "Filial3", "Filial1", "Filial2", "Filial3", ]
hier_index = list(zip(outside, inside))

In [67]:
hier_index

[('Mulheres', 'Filial1'),
 ('Mulheres', 'Filial2'),
 ('Mulheres', 'Filial3'),
 ('Homens', 'Filial1'),
 ('Homens', 'Filial2'),
 ('Homens', 'Filial3')]

In [68]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [69]:
dataframe2 = pd.DataFrame(np.random.randn(6, 2), index=hier_index, columns=["A", "B"])

In [70]:
dataframe2

                         A         B
Mulheres Filial1  0.178988 -0.547287
         Filial2  0.788768  1.004817
         Filial3 -2.055019 -1.228565
Homens   Filial1  0.188112  1.091009
         Filial2 -0.616408 -0.302199
         Filial3  2.982007 -0.420618

In [72]:
dataframe2.loc["Mulheres"]

                A         B
Filial1  0.178988 -0.547287
Filial2  0.788768  1.004817
Filial3 -2.055019 -1.228565

In [73]:
dataframe2.loc["Mulheres"].loc["Filial1"]

A    0.178988
B   -0.547287
Name: Filial1, dtype: float64

In [74]:
dataframe2.index

MultiIndex([('Mulheres', 'Filial1'),
            ('Mulheres', 'Filial2'),
            ('Mulheres', 'Filial3'),
            (  'Homens', 'Filial1'),
            (  'Homens', 'Filial2'),
            (  'Homens', 'Filial3')],
           )

In [75]:
dataframe2.index.names

FrozenList([None, None])

In [76]:
dataframe2.index.names = ["Grupo", "Filial"]

In [77]:
dataframe2

                         A         B
Grupo    Filial
Mulheres Filial1  0.178988 -0.547287
         Filial2  0.788768  1.004817
         Filial3 -2.055019 -1.228565
Homens   Filial1  0.188112  1.091009
         Filial2 -0.616408 -0.302199
         Filial3  2.982007 -0.420618

In [78]:
dataframe2.xs("Filial1", level="Filial")

                 A         B
Grupo
Mulheres  0.178988 -0.547287
Homens    0.188112  1.091009

## 5. Tratamento de dados

## 6. Group by

## 7. Merge e concat

## 8. Opera√ß√µes com dataframes

## 9. Series temporais

## 10. Input e output